const defaultOption = {
  data: [],
  dataset: {
    dimensions: ["车牌号", "里程数(km)"],
    source: [
      {
        "车牌号": "京A12341",
        "里程数(km)": "80.2"
      },
      {
        "车牌号": "京A12342",
        "里程数(km)": "134.2"
      },
      {
        "车牌号": "京A12343",
        "里程数(km)": "60.2"
      },
      {
        "车牌号": "京A12344",
        "里程数(km)": "30.2"
      },
      {
        "车牌号": "京A12345",
        "里程数(km)": "20.2"
      },
      {
        "车牌号": "京A12341",
        "里程数(km)": "90.2"
      },
      {
        "车牌号": "京A12342",
        "里程数(km)": "55.2"
      },
      {
        "车牌号": "京A12343",
        "里程数(km)": "100.2"
      },
      {
        "车牌号": "京A12344",
        "里程数(km)": "120.2"
      },
      {
        "车牌号": "京A12345",
        "里程数(km)": "15.2"
      }
    ]
  },
  rowNum: 5,
  waitTime: 3000,
  carousel: 'single',
  unit: '辆', // 单位显示
  sort: true, // 自动排序
  valueFormatter: null
};
export default defaultOption;
