/*
 * @Title: 
 * @Descripttion: 
 * @version: 
 * @Author: wzs
 * @Date: 2022-04-07 16:32:03
 * @LastEditors: wzs
 * @LastEditTime: 2022-04-08 15:53:14
 */
/*
 * @Title: 
 * @Descripttion: 
 * @version: 
 * @Author: wzs
 * @Date: 2022-04-01 13:32:24
 * @LastEditors: wzs
 * @LastEditTime: 2022-04-01 14:05:49
 */
const defaultOption = {
  // header: ["车牌号", "里程数(km)"],
  // data: [
  //   ["京A12345", "134.2"],
  //   ["京A12345", "134.2"],
  //   ["京A12345", "134.2"],
  //   ["京A12345", "134.2"],
  //   ["京A12345", "134.2"],
  //   ["京A12345", "134.2"],
  //   ["京A12345", "134.2"],
  //   ["京A12345", "134.2"],
  //   ["京A12345", "134.2"],
  //   ["京A12345", "134.2"],
  // ],
  // dataset: {
  //   source: [
  //     ["车牌号", "里程数(km)"],
  //     ["京A12341", "134.2"],
  //     ["京A12342", "134.2"],
  //     ["京A12343", "134.2"],
  //     ["京A12344", "134.2"],
  //     ["京A12345", "134.2"],
  //     ["京A12346", "134.2"],
  //     ["京A12347", "134.2"],
  //     ["京A12348", "134.2"],
  //     ["京A12349", "134.2"],
  //     ["京A12340", "134.2"],
  //   ],
  // },
  header: [],
  data: [],
  dataset: {
    dimensions: ["车牌号", "里程数(km)"],
    source: [
      {
        "车牌号": "京A12341",
        "里程数(km)": "134.2"
      },
      {
        "车牌号": "京A12342",
        "里程数(km)": "134.2"
      },
      {
        "车牌号": "京A12343",
        "里程数(km)": "134.2"
      },
      {
        "车牌号": "京A12344",
        "里程数(km)": "134.2"
      },
      {
        "车牌号": "京A12345",
        "里程数(km)": "134.2"
      },
      {
        "车牌号": "京A12341",
        "里程数(km)": "134.2"
      },
      {
        "车牌号": "京A12342",
        "里程数(km)": "134.2"
      },
      {
        "车牌号": "京A12343",
        "里程数(km)": "134.2"
      },
      {
        "车牌号": "京A12344",
        "里程数(km)": "134.2"
      },
      {
        "车牌号": "京A12345",
        "里程数(km)": "134.2"
      }
    ]
  },
  rowNum: 5,
  headerBGC: '#00BAFF',
  oddRowBGC: '#003B51',
  evenRowBGC: '#0A2732',
  headerHeight: 45,
  index: true,
  indexHeader: '#',
  carousel: 'single',
  columnWidth: [50],
  align: ["center", "left", "center"],
  waitTime: 3000,
  hoverPause: true
};
export default defaultOption;
